{
  "backend/main.mo": "Empty Motoko actor with no defined methods.",
  "feature_evidence.json": "Feature evidence report mapping features to related files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference.",
  "frontend/index.css": "Tailwind base styles plus OKLCH variable definitions and dark-mode overrides.",
  "frontend/index.html": "HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Renders the PortfolioPage component as the root app view.",
  "frontend/src/components/portfolio/AboutSection.tsx": "Renders the About section using text from portfolio content.",
  "frontend/src/components/portfolio/ArticleCard.tsx": "Displays an article with title, metadata, description, and outbound link.",
  "frontend/src/components/portfolio/ArticlesSection.tsx": "Renders categorized article groups and grids of ArticleCard components.",
  "frontend/src/components/portfolio/ExpertiseSection.tsx": "Displays expertise items in a responsive accent‑bordered card grid.",
  "frontend/src/components/portfolio/FooterSection.tsx": "Footer with copyright, last updated info, and caffeine.ai link.",
  "frontend/src/components/portfolio/HeaderSection.tsx": "Hero header with name, tagline, and expertise-tag badges.",
  "frontend/src/components/portfolio/PortfolioPage.tsx": "Composes all portfolio sections into a single-page layout.",
  "frontend/src/components/portfolio/StatsSection.tsx": "Shows key career statistics in a responsive grid.",
  "frontend/src/components/portfolio/StickyNav.tsx": "Sticky top navigation bar with smooth-scroll buttons.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider wrapping Dfinity AuthClient to manage Internet Identity login, stored identities, and login state flags.",
  "frontend/src/index.css": "Tailwind base layers plus custom OKLCH CSS variables for light/dark themes and global layout rules.",
  "frontend/src/lib/portfolioContent.ts": "Static TypeScript interfaces and data for portfolio articles, categories, expertise items, and stats.",
  "frontend/src/main.tsx": "Application entry point wiring React render root with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind config extending theme colors from CSS variables, adding plugins, animations, and container settings.",
  "project_state.json": "Project metadata describing the portfolio site’s scope, state version, requirements, and existing implemented features."
}