{
  "backend/main.mo": "Empty Motoko actor with no exposed methods.",
  "feature_evidence.json": "Feature evidence report describing an H1 text update in HeaderSection.tsx.",
  "frontend-file-summaries.txt": "Text file containing summaries of all frontend components and config files.",
  "frontend/index.css": "Tailwind CSS base file defining global OKLCH variables and theme tokens for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app and setting the page title.",
  "frontend/src/App.tsx": "Root React component that renders the PortfolioPage.",
  "frontend/src/components/portfolio/AboutSection.tsx": "Renders the About section with a title underline and mapped bio paragraphs.",
  "frontend/src/components/portfolio/ArticleCard.tsx": "Reusable article card showing title, metadata, description, and link using Card and Badge components.",
  "frontend/src/components/portfolio/ArticlesSection.tsx": "Displays article categories with section heading and a responsive grid of ArticleCard components.",
  "frontend/src/components/portfolio/ExpertiseSection.tsx": "Shows a grid of expertise items using Card components with left accent borders.",
  "frontend/src/components/portfolio/FooterSection.tsx": "Footer with copyright, last updated date, and a Caffeine.ai attribution link.",
  "frontend/src/components/portfolio/HeaderSection.tsx": "Hero header with name 'ShiBhu', tagline, and expertise tag badges over a dark gradient.",
  "frontend/src/components/portfolio/PortfolioPage.tsx": "Composes all portfolio sections including header, nav, content sections, and footer.",
  "frontend/src/components/portfolio/StatsSection.tsx": "Grid of career statistics displayed in Card components.",
  "frontend/src/components/portfolio/StickyNav.tsx": "Sticky navigation bar providing smooth scrolling to key sections.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching an authenticated or anonymous backend actor, invalidating queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication and state.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive OKLCH CSS variables for light/dark themes plus global styles.",
  "frontend/src/lib/portfolioContent.ts": "Provides TypeScript interfaces and static content arrays for articles, categories, expertise tags, and stats.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, OKLCH color mappings, animations, and plugin setup.",
  "project_state.json": "Tracks project metadata, requirements, and existing features for the portfolio site implementation."
}